roeetal/enph253/Software/STM32/brain/Src/main.c
    drive_straight_time(&enc_pid, LEFT_SPEED, RIGHT_SPEED+10, 5000);
    print("ewok\n", 0);

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while (1)
    {
        // /*
        //  * Pi Turning
        //  */

        if (PI_INT_STATE == FLAGGED)
        {
            // Stop Requesting Images
            print("Pi interrupt\n", 0);
            // Turn to ewok
            turn();

            // Drive forward w/ PID for 2.5 s, enable claw interrupt
            //    uint32_t start = HAL_GetTick();
            uint32_t time = HAL_GetTick();
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            while(HAL_GetTick()-time<2800){
                drive_straight(&enc_pid);
                // If we trip claw interrupt, debounce and grab it
                if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == GPIO_PIN_SET)
                {
                    print("Claw interrupt\n", 0);
                    debounce_and_grab(&enc_pid);
                    break;
                }
            }
            set_motor_speed(TIM_CHANNEL_1, 0);
            set_motor_speed(TIM_CHANNEL_3, 0);
            print("ewok\n", 0);
            PI_INT_STATE = NOT_FLAGGED;

        }else{

            ++searches;
            if(searches == 4 && ewok_cnt == 0){
                debounce_and_grab(&encoder_pid);
            }
            else if(searches == 3 && ewok_cnt == 1){
                debounce_and_grab(&encoder_pid);
            }
            else if(searches == 8 && ewok_cnt == 2){
                debounce_and_grab(&encoder_pid);
            }else{
            uint32_t time = HAL_GetTick();
            while(HAL_GetTick()-time<2800 && PI_INT_STATE == NOT_FLAGGED);
            int thresh = ewok_cnt==1? 500:750;
            set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
            set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
            time = HAL_GetTick();
            while(HAL_GetTick()-time<thresh){
                drive_straight(&enc_pid);
                // If we trip claw interrupt, debounce and grab it
                if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == GPIO_PIN_SET)
                {
                    print("Claw interrupt\n", 0);
                    debounce_and_grab(&enc_pid);
                    break;
                }
            }
            set_motor_speed(TIM_CHANNEL_1, 0);
            set_motor_speed(TIM_CHANNEL_3, 0);
            print("ewok\n", 0);
            }
        }
        /* 
        // Reset Claw Interrupt before driving forward
        print("MAIN | CLAW_INT UNFLAGGED\n", 0);
        while (HAL_GetTick()-start<3000)
        {
        drive_straight(&enc_pid);
        // If we trip claw interrupt, debounce and grab it
        if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == SET)
        {
        print("Claw interrupt\n", 0);
        if(debounce_and_grab(ewok_cnt, enc_pid)) break;
        }
        else if (HAL_GPIO_ReadPin(EDGE_LEFT_GPIO_Port, EDGE_LEFT_Pin) == RESET)
        {
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, 0);
        print("Edge left triggered", 0);
        turn_deg(30);
        }
        else if (HAL_GPIO_ReadPin(EDGE_RIGHT_GPIO_Port, EDGE_RIGHT_Pin) == RESET){
        print("Edge right triggered", 0);
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, 0);
        turn_deg(-30);
        }
        }

        }
        else
        {

*/
        /*
         * Look for Ewok
         */
        // CLAW_INT_STATE = NOT_FLAGGED;

        // if (ewok_cnt == 4 || ewok_cnt == 5)
        // {
        //     if (EDGE_LEFT_STATE == FLAGGED && EDGE_RIGHT_STATE == NOT_FLAGGED)
        //     {
        //         drive_straight_time(&enc_pid, 0, RIGHT_SPEED - 100, 400);
        //         uint32_t temp_time = HAL_GetTick();
        //         while ((HAL_GetTick() - temp_time) < 3000 && PI_INT_STATE == NOT_FLAGGED);
        //     }
        //     else if (EDGE_LEFT_STATE == NOT_FLAGGED && EDGE_RIGHT_STATE == FLAGGED)
        //     {
        //         drive_straight_time(&enc_pid, LEFT_SPEED - 100, 0, 400);
        //         uint32_t temp_time = HAL_GetTick();
        //         while ((HAL_GetTick() - temp_time) < 3000 && PI_INT_STATE == NOT_FLAGGED);
        //     }
        // }
        /*

           drive_straight_time(&enc_pid, LEFT_SPEED - 100, RIGHT_SPEED - 100, 500);
           print("ewok\n", 0);
           if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == SET)
           {
           print("Claw interrupt\n", 0);
           if(debounce_and_grab(ewok_cnt, enc_pid)) break;
           }
           else if (HAL_GPIO_ReadPin(EDGE_LEFT_GPIO_Port, EDGE_LEFT_Pin) == RESET)
           {
           set_motor_speed(TIM_CHANNEL_1, 0);
           set_motor_speed(TIM_CHANNEL_3, 0);
           print("Edge left triggered", 0);
           turn_deg(30);
           }
           else if (HAL_GPIO_ReadPin(EDGE_RIGHT_GPIO_Port, EDGE_RIGHT_Pin) == RESET){
           print("Edge right triggered", 0);
           set_motor_speed(TIM_CHANNEL_1, 0);
           set_motor_speed(TIM_CHANNEL_3, 0);
           turn_deg(-30);
           }
           uint32_t temp_time = HAL_GetTick();
           */
        /*
           else if (HAL_GPIO_ReadPin(EDGE_LEFT_GPIO_Port, EDGE_LEFT_Pin) == GPIO_PIN_RESET)
           {
           set_motor_speed(TIM_CHANNEL_1, 0);
           set_motor_speed(TIM_CHANNEL_3, 0);
           print("Edge left triggered", 0);
           turn_deg(30);
           }
           else if (HAL_GPIO_ReadPin(EDGE_RIGHT_GPIO_Port, EDGE_RIGHT_Pin) == GPIO_PIN_RESET){
           print("Edge right triggered", 0);
           set_motor_speed(TIM_CHANNEL_1, 0);
           set_motor_speed(TIM_CHANNEL_3, 0);
           turn_deg(-30);
           }
           */

        /* USER CODE END WHILE */

