roeetal/enph253/Software/STM32/brain/Src/main.c
/*
 * Assume motors are not on.
 * Reads adc, turns left or right based on voltage. Left max= 0 , no turn = 1.65 V, right max = 3.3V.
 */
void turn_deg(int16_t deg)
{
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    int16_t counts = 50.0 / 90.0 * (deg - 90) + 50;
    if (counts < 0) counts = -counts;
    TIM4->CNT = 0;
    TIM5->CNT = 0;

    char msg[50] = "";
    sprintf(msg, "TURN_DEG | turn count: %d\n", counts);
    print(msg, 0);

    if (deg > 0) // FIXME: Ben changed this
    {
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        set_motor_speed(TIM_CHANNEL_3, 0);
        while (TIM4->CNT < counts)
        {
            // sprintf(msg, "TIM5->CNT: %lu\n", TIM5->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TURN_DEG | TIM5->CNT: %lu\n", TIM5->CNT);
        print(msg, 4);
        TIM5->CNT = 0;
    }
    else if (deg < 0) // FIXME: Ben changed this
    {
        set_motor_speed(TIM_CHANNEL_1, 0);
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        while (TIM5->CNT < counts)
        {
            // sprintf(msg, "TIM4->CNT: %lu\n", TIM4->CNT);
            // print(msg, 4);
        }
        sprintf(msg, "TURN_DEG | TIM4->CNT: %lu\n", TIM4->CNT);
        print(msg, 4);
        TIM4->CNT = 0;
    }
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
    HAL_ADC_Stop_DMA(&hadc1);
}

/**
 * Resistor ladder: 8-bit, 0->3.3v.
 * ADC: 12-bit, 0->3.3V
 *
 * @param adc_val, value read from ADC.
 * @return heading as a percentage from -50 (left) to 50 (right).
 **/
float calculate_heading(uint32_t adc_val)
{
    return adc_val / 4096.0 - 0.5;
}

// Sampling frequency: 72e6/2/(495*2)
void alarm_detect() {
    HAL_ADC_Start_DMA(&hadc1, dma_buffer, sizeof(dma_buffer) / sizeof(dma_buffer[0]));
    HAL_Delay(500);
    char msg[20]="";
    int count = 0;
    while(1){
        if(count%50==0){
        sprintf(msg, "A %d\n", (int) goertzel(adc_values, 36363, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0));
        print(msg, 0);
        }
        ++count;
    }
    while (goertzel(adc_values, 36363, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0) < 50){
        if(count%50==0){
        sprintf(msg, "A %d\n", (int) goertzel(adc_values, 36363, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0));
        print(msg, 0);
        }
        ++count;
    }
    HAL_Delay(100);
    while (goertzel(adc_values, 36363, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0) > 50){
        if(count%100==0){
        sprintf(msg, "B %d\n", (int) goertzel(adc_values, 36363, 1000, sizeof(dma_buffer) / sizeof(dma_buffer[0]), 0));
        print(msg, 0);
        }
        ++count;
    }
    HAL_Delay(100);
    print("worcs", 0);
    HAL_ADC_Stop_DMA(&hadc1);
    IR_INT_STATE = NOT_FLAGGED;
}

/**
 * @brief prints string to row, rows from 0 - 6, resets screen when printing from row 0
 * @param msg, string to print
 * @param row, row to print msg to
 */
void print(char *msg, int row)
{
    // if (row == 0)
    // {
    //     ssd1306_Fill(Black);
    // }
    // ssd1306_SetCursor(0, row * 10);
    // ssd1306_WriteString(msg, Font_7x10, White);
    // ssd1306_UpdateScreen();
    HAL_UART_Transmit(&huart6, (uint8_t *) msg, strlen(msg), 100);
}

PID_t menu()
{
    print("Starting\n", 0);
    char msg[20] = "";
    int pid_select = 0;
    uint32_t values[2] = {0, 0};
    while (1)
    {
        if (HAL_GPIO_ReadPin(MENU_GPIO_Port, MENU_Pin) == 0)
        {
            sprintf(msg, "%lu\n", values[pid_select]);
            print(msg, 0);
            while (HAL_GPIO_ReadPin(MENU_GPIO_Port, MENU_Pin) == 0)
            {
                values[pid_select]++;
                sprintf(msg, "%lu\n", values[pid_select]);
                print(msg, 0);
                HAL_Delay(500);
            }
            ++pid_select;
        }
        if (pid_select == 2)
            break;
    }
    return pid_Init(values[0], values[1], 1, 1, 1);
}

void set_motor_speed(uint32_t channel, uint32_t speed)
{
    if (channel == TIM_CHANNEL_1)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, 0);
    }
    else if (channel == TIM_CHANNEL_2)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, 0);
    }
    else if (channel == TIM_CHANNEL_3)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_4, 0);
    }
    else if (channel == TIM_CHANNEL_4)
    {
        __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0);
    }
    __HAL_TIM_SET_COMPARE(&htim1, channel, speed > 1000 ? 1000 : speed);
}

void encoder_pid(PID_t *enc_pid)
{
    /* Get error */
    uint32_t lcnt = TIM4->CNT;
    uint32_t rcnt = TIM5->CNT;
    enc_pid->err = lcnt - rcnt;

    /* Get gain */
    // Gain <0 for ride side faster
    int gain = pid_GetGain(enc_pid);

    /* Set Motor Speeds*/
    uint32_t lspeed = LEFT_SPEED;
    uint32_t rspeed = RIGHT_SPEED;
    if (gain < 0)
    {
        lspeed -= gain;
    }
    else if (gain > 0)
    {
        rspeed += gain;
    }

    // char msg[18] = "";
    // sprintf(msg, "LS: %lu", lspeed);
    // print(msg, 0);
    // sprintf(msg, "RS: %lu", rspeed);
    // print(msg, 1);
    // set_motor_speed(TIM_CHANNEL_1, lspeed);
    // set_motor_speed(TIM_CHANNEL_3, rspeed);

    /* Prevent weird overflow shit */
    if (lcnt > 60000 || rcnt > 60000)
    {
        TIM4->CNT -= 50000;
        TIM5->CNT -= 50000;
    }
}

int debounce_and_grab(PID_t *enc_pid)
{
    uint32_t timeee = HAL_GetTick();
    // int count = 0;
    // while (HAL_GetTick() - timeee < 50)
    // {
    //     ++count;
    //     HAL_Delay(5);
    //     if (HAL_GPIO_ReadPin(CLAW_INT_GPIO_Port, CLAW_INT_Pin) == GPIO_PIN_RESET)
    //     {
    //         print("CLAW_GRAB | Claw debounced. No ewok found\n", 0);
    //         ewok = FALSE;
    //         break;
    //     }
    // }
    // char msg[50] = "";
    // sprintf(msg, "CLAW_GRAB | Debounced with %d checks\n", count);
    // print(msg, 0);
    // If claw is still high, we have an ewok. Stop, grab it, continue on
    // hardcoded procedure
    print("CLAW_GRAB | grabbing ewok\n", 0);
    HAL_Delay(700);
    set_motor_speed(TIM_CHANNEL_1, 0);
    set_motor_speed(TIM_CHANNEL_3, 0);
    close_claw(&htim3);
    arm_up(&htim3);
    // TODO: delete next line, there for testing!!!
    HAL_Delay(100);
    ++ewok_cnt;
    // char msg[18] = "";
    // sprintf(msg, "wok_cnt: %d\n", ewok_cnt);
    // print(msg, 0);
    /*
     * Claw is up and closed
     * Ewok Count incremented
     * Motors not powered
     * CLAW_INT_STATE not FLAGGED, interrupt disabled
     */

    // For the first ewok, turn left, arm up, square robot w/ edge,
    // drive straight for 3 s, bring arm down
    if (ewok_cnt == 1)
    {
        print("First ewok captured\n", 0);
        turn_deg(-160);
        open_claw(&htim3);
        LEFT_SPEED+=100;
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        square_edge(enc_pid);
        uint32_t time = HAL_GetTick();
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        while(HAL_GetTick()-time < 2000){
            drive_straight(enc_pid);
        }
        arm_down(&htim3);
        time = HAL_GetTick();
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        while(HAL_GetTick()-time < 1000){
            drive_straight(enc_pid);
        }
        set_motor_speed(TIM_CHANNEL_3, 0);
        set_motor_speed(TIM_CHANNEL_1, 0);
        // square_edge(&enc_pid);
        //        drive_straight_time(&enc_pid, LEFT_SPEED, RIGHT_SPEED, 10000);
    }

    if (ewok_cnt == 2)
    {
        print("Second ewok captured\n",0);
        if(ewok_cnt==2 && searches == 3){
        turn_deg(-200); //  Prolly have to change this
        }
        turn_deg(-190); //  Prolly have to change this
        //alarm_detect();
        open_claw(&htim3);
        uint32_t time = HAL_GetTick();
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        while(HAL_GetTick()-time < 1500){
            drive_straight(enc_pid);
            char msg[20] = "";
            sprintf(msg, "TL %d", HAL_GPIO_ReadPin(TAPE_LEFT_GPIO_Port, TAPE_LEFT_Pin));
            print(msg, 0);
            sprintf(msg, "TR %d", HAL_GPIO_ReadPin(TAPE_RIGHT_GPIO_Port, TAPE_RIGHT_Pin));
            print(msg, 0);
        }
        time = HAL_GetTick();
        set_motor_speed(TIM_CHANNEL_3, 800);
        set_motor_speed(TIM_CHANNEL_1, 900);
        while(HAL_GetTick()-time < 2000){
            drive_straight(enc_pid);
            char msg[20] = "";
            sprintf(msg, "TL %d", HAL_GPIO_ReadPin(TAPE_LEFT_GPIO_Port, TAPE_LEFT_Pin));
            print(msg, 0);
            sprintf(msg, "TR %d", HAL_GPIO_ReadPin(TAPE_RIGHT_GPIO_Port, TAPE_RIGHT_Pin));
            print(msg, 0);
        }
        arm_down(&htim3);
        set_motor_speed(TIM_CHANNEL_3, 0);
        set_motor_speed(TIM_CHANNEL_1, 0);
        /*
           timeee = HAL_GetTick();
           while (HAL_GetTick() - timeee < 7000)
           {
           if (TAPE_LEFT_STATE == FLAGGED && TAPE_RIGHT_STATE != FLAGGED)
           {
           set_motor_speed(TIM_CHANNEL_3, 0);
        // Tape detects object when high
        while (HAL_GPIO_ReadPin(TAPE_LEFT_GPIO_Port, TAPE_LEFT_Pin) == GPIO_PIN_SET);
        HAL_Delay(100);
        TAPE_LEFT_STATE = NOT_FLAGGED;
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        }
        else if (TAPE_RIGHT_STATE == FLAGGED && TAPE_LEFT_STATE != FLAGGED)
        {
        set_motor_speed(TIM_CHANNEL_1, 0);
        while (HAL_GPIO_ReadPin(TAPE_RIGHT_GPIO_Port, TAPE_RIGHT_Pin) == GPIO_PIN_SET);
        HAL_Delay(100);
        TAPE_RIGHT_STATE = NOT_FLAGGED;
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        }
        }
        */
    }

    if (ewok_cnt == 3)
    {
        print("Third ewok captured\n", 0);
        turn_deg(170);
        set_motor_speed(TIM_CHANNEL_3, RIGHT_SPEED);
        set_motor_speed(TIM_CHANNEL_1, LEFT_SPEED);
        square_edge(enc_pid);
        open_claw(&htim3);
        drive_straight_time(enc_pid, LEFT_SPEED+150, RIGHT_SPEED+150, 2000);
        arm_down(&htim3);
        uint8_t deg = 0;
        while(PI_INT_STATE != FLAGGED){
            if(deg>6){turn_deg(20);}else{
                turn_deg(-20);
            }
            ++deg;
            uint32_t time = HAL_GetTick();
            while(HAL_GetTick()-time<3000 && PI_INT_STATE == NOT_FLAGGED);
        }
    }

